#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.logs.aws_cloudwatch_log_group.get_growth_and_margin_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_growth_and_margin_lambda_function]
module.policy.aws_iam_role.companies_kpi_average_lambda_exec_role: Refreshing state... [id=demo_companies_kpi_average_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_scenarios_lambda_function]
module.network.aws_api_gateway_method.get_companies_kpi_average_method: Refreshing state... [id=agm-kb7gblbu69-nzd6kx-GET]
module.policy.aws_iam_role_policy_attachment.get_revenue_and_ebitda_lambda_logs: Refreshing state... [id=demo_get_revenue_and_ebitda_lambda_exec_role-20211206195416259100000001]
module.policy.aws_iam_role.get_revenue_and_ebitda_lambda_exec_role: Refreshing state... [id=demo_get_revenue_and_ebitda_lambda_exec_role]
module.network.aws_api_gateway_resource.companies_count_by_size: Refreshing state... [id=8cccuf]
module.network.aws_api_gateway_resource.revenue_and_ebitda: Refreshing state... [id=n74ec0]
module.policy.aws_lambda_permission.apigw_get_expected_growth_and_margin_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayExpectedGrowthAndMargin]
module.logs.aws_cloudwatch_log_group.get_metric_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_by_company_id_lambda_function]
module.network.aws_api_gateway_integration.companies_kpi_average_integration: Refreshing state... [id=agi-kb7gblbu69-nzd6kx-GET]
module.network.aws_api_gateway_integration.expected_growth_and_margin_integration: Refreshing state... [id=agi-kb7gblbu69-2xxfg3-GET]
module.network.aws_api_gateway_integration.companies_count_by_size_integration: Refreshing state... [id=agi-kb7gblbu69-8cccuf-GET]
module.network.aws_api_gateway_resource.companies_kpi_average: Refreshing state... [id=nzd6kx]
module.functions.aws_lambda_function.get_expected_growth_and_margin_lambda_function: Refreshing state... [id=demo_get_expected_growth_and_margin_lambda_function]
module.policy.aws_iam_role.get_expected_growth_and_margin_lambda_exec_role: Refreshing state... [id=demo_get_expected_growth_and_margin_lambda_exec_role]
module.policy.aws_iam_role.get_growth_and_margin_lambda_exec_role: Refreshing state... [id=demo_get_growth_and_margin_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_companies_count_by_size_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_companies_count_by_size_lambda_function]
module.policy.aws_lambda_permission.apigw_get_revenue_and_ebitda_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueAndEbitda]
module.buckets.aws_s3_bucket_object.get_revenue_and_ebitda_function_object: Refreshing state... [id=lambdas/demo/get_revenue_and_ebitda_handler.zip]
module.policy.aws_lambda_permission.apigw_get_companies_count_by_size_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.buckets.aws_s3_bucket_object.get_companies_kpi_average_function_object: Refreshing state... [id=lambdas/demo/get_companies_kpi_average_handler.zip]
module.functions.aws_lambda_function.get_revenue_and_ebitda_lambda_function: Refreshing state... [id=demo_get_revenue_and_ebitda_lambda_function]
module.network.aws_api_gateway_resource.growth_and_margin: Refreshing state... [id=d1oz8z]
module.policy.aws_iam_role_policy_attachment.get_revenue_and_ebitda_lambda_vpc: Refreshing state... [id=demo_get_revenue_and_ebitda_lambda_exec_role-20211206195416725500000002]
module.policy.aws_iam_role_policy_attachment.companies_kpi_average_lambda_vpc: Refreshing state... [id=demo_companies_kpi_average_lambda_exec_role-20211203145959698700000003]
module.policy.aws_iam_role_policy_attachment.get_expected_growth_and_margin_lambda_vpc: Refreshing state... [id=demo_get_expected_growth_and_margin_lambda_exec_role-20211206132112928300000002]
module.policy.aws_lambda_permission.apigw_get_growth_and_margin_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGrowthAndMargin]
module.network.aws_api_gateway_resource.expected_growth_and_margin: Refreshing state... [id=2xxfg3]
module.policy.aws_iam_role.companies_count_by_size_lambda_exec_role: Refreshing state... [id=demo_companies_count_by_size_lambda_exec_role]
module.policy.aws_iam_role_policy_attachment.get_expected_growth_and_margin_lambda_logs: Refreshing state... [id=demo_get_expected_growth_and_margin_lambda_exec_role-20211206132112922400000001]
module.network.aws_api_gateway_method.get_growth_and_margin_method: Refreshing state... [id=agm-kb7gblbu69-d1oz8z-GET]
module.logs.aws_cloudwatch_log_group.get_expected_growth_and_margin_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_expected_growth_and_margin_lambda_function]
module.buckets.aws_s3_bucket_object.get_expected_growth_and_margin_function_object: Refreshing state... [id=lambdas/demo/get_expected_growth_and_margin_hanlder.zip]
module.network.aws_api_gateway_method.get_companies_count_by_size_method: Refreshing state... [id=agm-kb7gblbu69-8cccuf-GET]
module.policy.aws_iam_role_policy_attachment.get_growth_and_margin_lambda_vpc: Refreshing state... [id=demo_get_growth_and_margin_lambda_exec_role-20211203173419901400000001]
module.policy.aws_lambda_permission.apigw_get_companies_kpi_average_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role_policy_attachment.companies_kpi_average_lambda_logs: Refreshing state... [id=demo_companies_kpi_average_lambda_exec_role-20211203145959763300000004]
module.functions.aws_lambda_function.get_growth_and_margin_lambda_function: Refreshing state... [id=demo_get_growth_and_margin_lambda_function]
module.policy.aws_iam_role_policy_attachment.companies_count_by_size_lambda_logs: Refreshing state... [id=demo_companies_count_by_size_lambda_exec_role-20211203145958636500000001]
module.logs.aws_cloudwatch_log_group.get_companies_kpi_average_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_companies_kpi_average_lambda_function]
module.policy.aws_iam_role_policy_attachment.companies_count_by_size_lambda_vpc: Refreshing state... [id=demo_companies_count_by_size_lambda_exec_role-20211203145958636500000002]
module.functions.aws_lambda_function.get_companies_kpi_average_lambda_function: Refreshing state... [id=demo_get_companies_kpi_average_lambda_function]
module.buckets.aws_s3_bucket_object.get_companies_count_by_size_function_object: Refreshing state... [id=lambdas/demo/get_companies_count_by_size_handler.zip]
module.buckets.aws_s3_bucket_object.get_growth_and_margin_function_object: Refreshing state... [id=lambdas/demo/get_growth_and_margin_hanlder.zip]
module.policy.aws_iam_role_policy_attachment.get_growth_and_margin_lambda_logs: Refreshing state... [id=demo_get_growth_and_margin_lambda_exec_role-20211203173419911900000002]
module.network.aws_api_gateway_method.get_revenue_and_ebitda_method: Refreshing state... [id=agm-kb7gblbu69-n74ec0-GET]
module.logs.aws_cloudwatch_log_group.get_revenue_and_ebitda_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_and_ebitda_lambda_function]
module.network.aws_api_gateway_integration.growth_and_margin_integration: Refreshing state... [id=agi-kb7gblbu69-d1oz8z-GET]
module.network.aws_api_gateway_integration.revenue_and_ebitda_integration: Refreshing state... [id=agi-kb7gblbu69-n74ec0-GET]
module.functions.aws_lambda_function.get_companies_count_by_size_lambda_function: Refreshing state... [id=demo_get_companies_count_by_size_lambda_function]
module.network.aws_api_gateway_method.get_expected_growth_and_margin_method: Refreshing state... [id=agm-kb7gblbu69-2xxfg3-GET]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.logs.aws_cloudwatch_log_group.get_cohorts_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohorts_lambda_function]
module.logs.aws_cloudwatch_log_group.get_average_metrics_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_by_cohort_lambda_function]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_company_lambda_function]
module.policy.aws_iam_role.get_revenue_sum_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_cohort_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_scenarios_lambda_function]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_cohort_handler.zip]
module.buckets.aws_s3_bucket_object.get_average_metrics_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_handler.zip]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.logs.aws_cloudwatch_log_group.get_average_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_lambda_function]
module.policy.aws_iam_role.get_company_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_cohort_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_by_id_lambda_function]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.policy.aws_iam_role.company_lambda_exec_role: Refreshing state... [id=demo_company_lambda_exec_role]
module.policy.aws_iam_role.get_metric_by_company_id_lambda_exec_role: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role]
module.policy.aws_iam_role.list_scenarios_lambda_exec_role: Refreshing state... [id=demo_list_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_company_scenarios_handler.zip]
module.policy.aws_iam_role.get_metrics_lambda_exec_role: Refreshing state... [id=demo_get_metrics_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object: Refreshing state... [id=lambdas/demo/get_metrics_by_cohort_id_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/get_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_metrics_function_object: Refreshing state... [id=lambdas/demo/get_metrics_handler.zip]
module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_cohort_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.policy.aws_iam_role.get_average_metrics_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object: Refreshing state... [id=lambdas/demo/get_cohort_by_id_handler.zip]
module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_by_cohort_handler.zip]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.policy.aws_iam_role.get_metrics_by_cohort_id_lambda_exec_role: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.policy.aws_iam_role.get_revenue_sum_by_company_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.logs.aws_cloudwatch_log_group.get_company_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.list_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_list_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_metrics_by_cohort_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_by_cohort_id_lambda_function]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.get_cohort_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_lambda_function]
module.policy.aws_iam_role.get_average_metrics_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role]
module.policy.aws_iam_role.get_cohort_by_id_lambda_exec_role: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_cohorts_function_object: Refreshing state... [id=lambdas/demo/get_cohorts_handler.zip]
module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object: Refreshing state... [id=lambdas/demo/get_metric_by_company_id_handler.zip]
module.buckets.aws_s3_bucket_object.list_scenarios_function_object: Refreshing state... [id=lambdas/demo/list_scenarios_handler.zip]
module.logs.aws_cloudwatch_log_group.get_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_lambda_function]
module.policy.aws_iam_role.get_cohorts_lambda_exec_role: Refreshing state... [id=demo_get_cohorts_lambda_exec_role]
module.policy.aws_iam_role.get_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_scenarios_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.network.aws_api_gateway_resource.cohorts: Refreshing state... [id=97prpe]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=1cyyi4]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=ifcpo2]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041371600000002]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_vpc: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844570400000002]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_vpc: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816484600000001]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234099900000003]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_vpc: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170238199900000002]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_vpc: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238922300000004]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_vpc: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817567900000006]
module.policy.aws_iam_role_policy_attachment.get_metric_by_id_lambda_vpc: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232341900000001]
module.policy.aws_iam_role_policy_attachment.company_lambda_vpc: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000900000003]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041443600000003]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_vpc: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817033600000003]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782000000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_vpc: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402192800000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_logs: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402226000000002]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_vpc: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234097000000001]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_logs: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234098900000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041296600000001]
module.policy.aws_iam_role_policy_attachment.company_lambda_logs: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000100000002]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_logs: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041624400000004]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_logs: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238921300000003]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_logs: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817488400000005]
module.policy.aws_iam_role_policy_attachment.get_metric_by_company_id_lambda_logs: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232357400000002]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_logs: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844569300000001]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_logs: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816576300000002]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_logs: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234575000000004]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_logs: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170237751100000001]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782400000002]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_logs: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817268600000004]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=d5yeld]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.network.aws_api_gateway_resource.cohort: Refreshing state... [id=5k8zew]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.network.aws_api_gateway_resource.cohort_revenue: Refreshing state... [id=pymy9y]
module.network.aws_api_gateway_method.get_cohorts_method: Refreshing state... [id=agm-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_resource.scenarios_list: Refreshing state... [id=tp2zxu]
module.network.aws_api_gateway_method.get_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_resource.scenario_company: Refreshing state... [id=z01lfb]
module.network.aws_api_gateway_resource.metric_cohort: Refreshing state... [id=fjgqv3]
module.network.aws_api_gateway_resource.company_metric: Refreshing state... [id=2ty0vw]
module.network.aws_api_gateway_method.get_metrics_method: Refreshing state... [id=agm-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_resource.company_revenue: Refreshing state... [id=cl0jnm]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.network.aws_api_gateway_method.get_cohort_by_id_method: Refreshing state... [id=agm-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_resource.scenarios_company_id: Refreshing state... [id=znsrwp]
module.network.aws_api_gateway_resource.cohort_scenarios: Refreshing state... [id=63z04b]
module.network.aws_api_gateway_method.get_revenue_sum_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_method.list_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-tp2zxu-GET]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_resource.metric_cohort_id: Refreshing state... [id=rr716m]
module.network.aws_api_gateway_resource.metric: Refreshing state... [id=k9hbzo]
module.network.aws_api_gateway_method.get_revenue_sum_by_company_method: Refreshing state... [id=agm-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_method.get_company_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_method.get_cohort_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_method.get_metric_by_company_id_method: Refreshing state... [id=agm-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_resource.average_metrics: Refreshing state... [id=ww2zcl]
module.network.aws_api_gateway_resource.cohort_average_metric: Refreshing state... [id=hdyvp6]
module.network.aws_api_gateway_resource.cohort_metrics: Refreshing state... [id=rtzpd4]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.network.aws_api_gateway_method.get_average_metrics_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_method.get_average_metrics_method: Refreshing state... [id=agm-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_method.get_metrics_by_cohort_id_method: Refreshing state... [id=agm-kb7gblbu69-rtzpd4-GET]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.functions.aws_lambda_function.get_average_metrics_function: Refreshing state... [id=demo_get_average_metrics_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_function]
module.functions.aws_lambda_function.get_metric_by_company_id_function: Refreshing state... [id=demo_get_metric_by_company_id_lambda_function]
module.functions.aws_lambda_function.list_scenarios_lambda_function: Refreshing state... [id=demo_list_scenarios_lambda_function]
module.functions.aws_lambda_function.get_cohorts_function: Refreshing state... [id=demo_get_cohorts_lambda_function]
module.functions.aws_lambda_function.get_metrics_function: Refreshing state... [id=demo_get_metrics_lambda_function]
module.functions.aws_lambda_function.get_cohort_by_id_function: Refreshing state... [id=demo_get_cohort_by_id_lambda_function]
module.functions.aws_lambda_function.get_scenarios_lambda_function: Refreshing state... [id=demo_get_scenarios_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_by_cohort_function: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_cohorts_scenarios_function: Refreshing state... [id=demo_get_cohort_scenarios_lambda_function]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.functions.aws_lambda_function.get_company_scenarios_lambda_function: Refreshing state... [id=demo_get_company_scenarios_lambda_function]
module.functions.aws_lambda_function.get_metrics_by_cohort_id_function: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_function]
module.functions.aws_s3_bucket_notification.files_bucket_notification: Refreshing state... [id=kpinetwork-files]
module.policy.aws_lambda_permission.apigw_get_average_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAverage]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_metrics_by_cohort_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortId]
module.policy.aws_lambda_permission.apigw_list_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayListScenarios]
module.policy.aws_lambda_permission.apigw_get_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetScenarios]
module.policy.aws_lambda_permission.apigw_get_metric_by_company_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_cohort_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_cohort_by_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_cohorts_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_average_metrics_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortAverage]
module.policy.aws_lambda_permission.apigw_get_company_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyScenarios]
module.network.aws_api_gateway_integration.revenue_sum_by_company_integration: Refreshing state... [id=agi-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_integration.cohorts_integration: Refreshing state... [id=agi-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_cohort_integration: Refreshing state... [id=agi-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_integration.scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_integration.metrics_integration: Refreshing state... [id=agi-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_integration.cohort_by_id_integration: Refreshing state... [id=agi-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_integration.average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.metrics_by_cohort_id_integration: Refreshing state... [id=agi-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_integration.cohort_average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_integration.metric_by_company_id_integration: Refreshing state... [id=agi-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_integration.cohort_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_integration.company_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_integration.scenarios_list_integration: Refreshing state... [id=agi-kb7gblbu69-tp2zxu-GET]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.functions.aws_s3_bucket_notification.files_bucket_notification has been changed
  ~ resource "aws_s3_bucket_notification" "files_bucket_notification" {
        id     = "kpinetwork-files"
        # (1 unchanged attribute hidden)

      ~ lambda_function {
          ~ filter_prefix       = "demo/" -> "prod/"
          ~ id                  = "aws_s3_bucket_notification_demo_glue_trigger_lambda_function" -> "aws_s3_bucket_notification_prod_glue_trigger_lambda_function"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:435552912911:function:demo_glue_trigger_lambda_function" -> "arn:aws:lambda:us-west-2:435552912911:function:prod_glue_trigger_lambda_function"
            # (1 unchanged attribute hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "3f6cc68782013006e9f9d5f0534e9c33" -> "e642ad00ef0b4d9ca477ef3da9ecc4d6"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_by_cohort_function_object" {
      ~ etag               = "63d61d4ece9641abc59123e6dcae2722" -> "9eb52b4a5e5915e06001b4b2a2828115"
        id                 = "lambdas/demo/get_average_metrics_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_function_object" {
      ~ etag               = "9a3db8a532aa3dcfa1711d0b3c5e2c66" -> "ca6954b2b8ea8a611d8cc0c9a5aa0321"
        id                 = "lambdas/demo/get_average_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_by_id_function_object" {
      ~ etag               = "5b324d4489b6c05400ced436c8f2fb40" -> "f5e8f738428dc6f34f4c62c3d9975836"
        id                 = "lambdas/demo/get_cohort_by_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_scenarios_function_object" {
      ~ etag               = "4fc02ba05467a97c8de54c60a26c50c9" -> "25dbcc300b3d161901b040c8f3512e93"
        id                 = "lambdas/demo/get_cohort_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohorts_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohorts_function_object" {
      ~ etag               = "5342c6bad2129f1c4d5b6c79d98af81e" -> "8654e3bd826922b9313cc5513e3fe625"
        id                 = "lambdas/demo/get_cohorts_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_companies_count_by_size_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_companies_count_by_size_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "c709d1b37a02bac1ed653c0fd8f1e73b" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_companies_count_by_size_handler.zip" -> null
      - key                = "lambdas/demo/get_companies_count_by_size_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_companies_count_by_size_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_companies_kpi_average_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_companies_kpi_average_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "e902888c115c9036d6935e832e55b2a7" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_companies_kpi_average_handler.zip" -> null
      - key                = "lambdas/demo/get_companies_kpi_average_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_companies_kpi_average_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_function_object" {
      ~ etag               = "0fe8c8c0ba969f436be9cf8f138c1dfd" -> "9268766fe07b1d9551c4d694631835f4"
        id                 = "lambdas/demo/get_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_scenarios_function_object" {
      ~ etag               = "0e69fdc75bac69b8fed4cccd316f65fd" -> "509f2849456d13c9c14251a25e2fd0ce"
        id                 = "lambdas/demo/get_company_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_expected_growth_and_margin_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_expected_growth_and_margin_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "0283fb6a6a8416ed8eb1deb96963c154" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_expected_growth_and_margin_hanlder.zip" -> null
      - key                = "lambdas/demo/get_expected_growth_and_margin_hanlder.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_expected_growth_and_margin_hanlder.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_growth_and_margin_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_growth_and_margin_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "ce6e8d999420cdc3c4b21b59c6fe3586" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_growth_and_margin_hanlder.zip" -> null
      - key                = "lambdas/demo/get_growth_and_margin_hanlder.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_growth_and_margin_hanlder.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_by_company_id_function_object" {
      ~ etag               = "19f840541fc657a03b9663a3d1351d24" -> "642b95a5858235ac7bf2d633a75979d4"
        id                 = "lambdas/demo/get_metric_by_company_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_by_cohort_id_function_object" {
      ~ etag               = "f6e4df3323036e19722a505a4b986e5f" -> "1abec7ddb248e8ddf80412c6bdf8d950"
        id                 = "lambdas/demo/get_metrics_by_cohort_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_function_object" {
      ~ etag               = "546ee0a8d1e10d4de4b7a1fe29060fdd" -> "00aad2adcdbc2528c131b836ebbb1978"
        id                 = "lambdas/demo/get_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_and_ebitda_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_revenue_and_ebitda_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "e8dfda749c36845653a47b7d54efa06d" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_revenue_and_ebitda_handler.zip" -> null
      - key                = "lambdas/demo/get_revenue_and_ebitda_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_revenue_and_ebitda_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_cohort_function_object" {
      ~ etag               = "5eea933c61026ebf93c0d1681b9fb5d7" -> "ed4b8255927a5a68e30ab3992bcb85ab"
        id                 = "lambdas/demo/get_revenue_sum_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_company_function_object" {
      ~ etag               = "bceb40d3b84c2091ec7e565d4b7e7d84" -> "89f8393021526ee5760ced9989338601"
        id                 = "lambdas/demo/get_revenue_sum_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_scenarios_function_object" {
      ~ etag               = "173f4a5a104bad5cb880322e35ecf56b" -> "736eb731b7223c27b9dc591f467d6abe"
        id                 = "lambdas/demo/get_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be created
  + resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "6d4924414c26897b5f4808e38535a3a6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_universe_overview_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_universe_overview_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "e9707604cd0492713b8480c6557442d5" -> "a82eac5f67193e7eeec93fd9031e5cdd"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "bc076c6b073fcbcf40e24e7bc6668282" -> "0b632bd5a23bee91d68516cd86a3a08e"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.list_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "list_scenarios_function_object" {
      ~ etag               = "77824244588049ec55cf5fde4ff0c810" -> "4bb8c6df83943b39e46118b3c6889f2f"
        id                 = "lambdas/demo/list_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2021-12-06T22:41:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "HrJqcG+Ydr7Gm+31ac0q8tmXvPaOaCuR5I4/qoM9dIA=" -> "pR+MRMTAmum5nAjZ1hBRGod6wZu7e9H9bWJh32SNaRw="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_by_cohort_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_by_cohort_function" {
        id                             = "demo_get_average_metrics_by_cohort_lambda_function"
      ~ last_modified                  = "2021-12-06T22:42:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "w9q88+wsfb8hY/XWUX7KrN2vFl/krJ4mHV0VzKAxVTw=" -> "2DVgK8G6QVYTah2vR+4CbXnlVPGSrfda9uETQnrOUp0="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_function" {
        id                             = "demo_get_average_metrics_lambda_function"
      ~ last_modified                  = "2021-12-06T22:41:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "feC+6mU2d25yNVR68uDLoWqv6+Phb8t+kfwQX6hMgxA=" -> "PfpKzBFe8c/xsmt8XEXAfmxcAvwbXpRJYKrTFhOETOo="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohort_by_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohort_by_id_function" {
        id                             = "demo_get_cohort_by_id_lambda_function"
      ~ last_modified                  = "2021-12-06T22:41:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "T0CaU2DXujfVuzCwArjfR32Nt8T7ZiWBDvDCHA1xsqw=" -> "AodjqD50QI0I2HV9HgBJ7FhKbLkJVPVtDS9YNpIr9W0="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_function" {
        id                             = "demo_get_cohorts_lambda_function"
      ~ last_modified                  = "2021-12-06T22:42:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "g+//stoEBLwT2l6y7squqyafvnK4efOisOZGTFNEml8=" -> "GbQJhKcR0zCv9FkTd5WCNeSqG8+k+mH9YnLeN3ItGis="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_scenarios_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_scenarios_function" {
        id                             = "demo_get_cohort_scenarios_lambda_function"
      ~ last_modified                  = "2021-12-06T22:41:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "rs90kpRkoRUVYWlnkAXmK17KUlZ5bBHGv3ZrVDCND6Q=" -> "NDGNVIf6Ya4u4SvKU9ps+a/L/x5fbjvPYRel+z9/nwM="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_companies_count_by_size_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_companies_count_by_size_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_count_by_size_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_companies_count_by_size_lambda_function" -> null
      - handler                        = "get_companies_count_by_size_handler.handler" -> null
      - id                             = "demo_get_companies_count_by_size_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_count_by_size_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-12-06T22:41:58.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_count_by_size_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_companies_count_by_size_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_companies_count_by_size_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "GZZy5qk6IBx9db/ZuROrpgoBYYC5h88AEL9pO0yjOoQ=" -> null
      - source_code_size               = 5076 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_companies_kpi_average_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_companies_kpi_average_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_kpi_average_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_companies_kpi_average_lambda_function" -> null
      - handler                        = "get_companies_kpi_average_handler.handler" -> null
      - id                             = "demo_get_companies_kpi_average_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_kpi_average_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-12-06T22:42:33.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_kpi_average_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_companies_kpi_average_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_companies_kpi_average_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "l0+nPE2BFD+0bjqFQcQay1GiowYEs7RjeUy1R8Yw2gI=" -> null
      - source_code_size               = 5162 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2021-12-06T22:42:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "S8tWTcwlea9+tQxj5lOvTxSzE/vCYFefA9OBzsJ9Krc=" -> "kIwkTpGa4jWz2Ew4Arr3M5xGPfOTeTr1iIKX9ilSnl8="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_scenarios_lambda_function" {
        id                             = "demo_get_company_scenarios_lambda_function"
      ~ last_modified                  = "2021-12-06T22:42:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "FTMvca6ia4x3wvg3gswoIVpn1c2qfbAhXaQL+IoHo/0=" -> "l2USQ2qrWR9KEITmcM2dRIY8kziLMMmM9oKIp0s12Ic="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_expected_growth_and_margin_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_expected_growth_and_margin_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_expected_growth_and_margin_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_expected_growth_and_margin_lambda_function" -> null
      - handler                        = "get_expected_growth_and_margin_handler.handler" -> null
      - id                             = "demo_get_expected_growth_and_margin_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_expected_growth_and_margin_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-12-06T22:41:58.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_expected_growth_and_margin_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_expected_growth_and_margin_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_expected_growth_and_margin_hanlder.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "2mGsjQIO3OgQTuMqGA7RSLHN9/adH2aReRYRIpHN2Y8=" -> null
      - source_code_size               = 5136 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_growth_and_margin_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_growth_and_margin_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_growth_and_margin_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_growth_and_margin_lambda_function" -> null
      - handler                        = "get_growth_and_margin_handler.handler" -> null
      - id                             = "demo_get_growth_and_margin_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_growth_and_margin_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-12-06T22:42:33.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_growth_and_margin_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_growth_and_margin_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_growth_and_margin_hanlder.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "Gp6OKxubdK3/vwk4KpeyRAOurIBNfVBf9TqldRE81M4=" -> null
      - source_code_size               = 5106 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_metric_by_company_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_by_company_id_function" {
        id                             = "demo_get_metric_by_company_id_lambda_function"
      ~ last_modified                  = "2021-12-06T22:41:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "BrQTC2Za7GMQhsWxG5YV/1q9Jt4FgJKdRUmtVvn1aB0=" -> "F8uwhrrmgklVPjJ+cDKTdNN3KzJeGmMV550XCMYPKFE="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_by_cohort_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_by_cohort_id_function" {
        id                             = "demo_get_metrics_by_cohort_id_lambda_function"
      ~ last_modified                  = "2021-12-06T22:42:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "GIVe/6gnBZaneht6xpCi0Y7twoRIQNa1H3Mg/Ud/Ucs=" -> "69j7dZukwx5PTrNmBvpONlZcDtFYD4Z/Ad/OUOeKSt0="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_function" {
        id                             = "demo_get_metrics_lambda_function"
      ~ last_modified                  = "2021-12-06T22:41:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "+6zLZkwAxXryPkr7Kl4CjtJ52igrTCpDkLmRQHgOL84=" -> "uuZjc7alQUbZL8ktILpl6DhxjigEOPpjv2ZoNFAFoEM="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_and_ebitda_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_revenue_and_ebitda_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_revenue_and_ebitda_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_revenue_and_ebitda_lambda_function" -> null
      - handler                        = "get_revenue_and_ebitda_handler.handler" -> null
      - id                             = "demo_get_revenue_and_ebitda_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_revenue_and_ebitda_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-12-06T22:42:34.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_revenue_and_ebitda_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_revenue_and_ebitda_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_revenue_and_ebitda_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "EZ9+ahnzLsmhe/hXfDZJjwLRox5qppbmqkq66oouP4I=" -> null
      - source_code_size               = 5107 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_cohort_lambda_function" {
        id                             = "demo_get_revenue_sum_by_cohort_lambda_function"
      ~ last_modified                  = "2021-12-06T22:42:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "LaNSZIZb2tlRtBPVdcX/1qL+Thh7thrB4GJ6Z7fnqH8=" -> "873l446arL12SUqrR5SixX83ermLkYjSq/74GaCgfe4="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_company_lambda_function" {
        id                             = "demo_get_revenue_sum_by_company_lambda_function"
      ~ last_modified                  = "2021-12-06T22:41:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "9GcfgNhyts3pHscWQN4olJ6Kek6t5eSfWCdUQc/PZnk=" -> "te/lhwXWt+T7j0JXodtaLRlHYylVs0CIOWPqMlQZlg4="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_scenarios_lambda_function" {
        id                             = "demo_get_scenarios_lambda_function"
      ~ last_modified                  = "2021-12-06T22:42:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "MfHpPPvXwEUAjJgnwlfS2xTu49uhya0ZtPPuA/wnjog=" -> "zhE7F31sTWw+CwQ9yXikGKQg7kmbu5c44ZlNOxfhfeU="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be created
  + resource "aws_lambda_function" "get_universe_overview_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_universe_overview_lambda_function"
      + handler                        = "get_universe_overview_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_universe_overview_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "wBbQk93JfeAcSpvix7b+ZSmrFvFI28GGSYcMhYF2oFo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = (sensitive)
              + "DB_NAME"     = "demokpinetworkdb"
              + "DB_PASSWORD" = (sensitive)
              + "DB_USERNAME" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0b0383c09324099c1",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2021-12-06T22:41:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "OCEQEiXQAgE7IjPiWnlMBntvGZzhrnRuJngvbQHQUsc=" -> "u5Jhf7UqFmBTZ8afNKecNyT8ParCke+DxwnGMOa4QbY="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.list_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "list_scenarios_lambda_function" {
        id                             = "demo_list_scenarios_lambda_function"
      ~ last_modified                  = "2021-12-06T22:42:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "xiPoEq6XLoxTSxNfA9HK6sMrweAExPdZRJmqFPbVmOs=" -> "feIhoRGx4DFen4i2heDwtBGSJkqi+jk1fECTnKL7a0U="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_s3_bucket_notification.files_bucket_notification will be updated in-place
  ~ resource "aws_s3_bucket_notification" "files_bucket_notification" {
        id     = "kpinetwork-files"
        # (1 unchanged attribute hidden)

      ~ lambda_function {
          ~ filter_prefix       = "prod/" -> "demo/"
          ~ id                  = "aws_s3_bucket_notification_prod_glue_trigger_lambda_function" -> "aws_s3_bucket_notification_demo_glue_trigger_lambda_function"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:435552912911:function:prod_glue_trigger_lambda_function" -> "arn:aws:lambda:us-west-2:435552912911:function:demo_glue_trigger_lambda_function"
            # (1 unchanged attribute hidden)
        }
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2021-12-06T22:41:55Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "d5yeld" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at d 2021-12-06T22:41:54Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_companies_count_by_size_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_companies_count_by_size_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_companies_count_by_size_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_companies_count_by_size_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_companies_count_by_size_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_companies_kpi_average_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_companies_kpi_average_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_companies_kpi_average_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_companies_kpi_average_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_companies_kpi_average_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_expected_growth_and_margin_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_expected_growth_and_margin_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_expected_growth_and_margin_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_expected_growth_and_margin_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_expected_growth_and_margin_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_growth_and_margin_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_growth_and_margin_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_growth_and_margin_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_growth_and_margin_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_growth_and_margin_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_revenue_and_ebitda_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_revenue_and_ebitda_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_revenue_and_ebitda_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_revenue_and_ebitda_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_revenue_and_ebitda_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_universe_overview_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_universe_overview_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.companies_count_by_size_integration will be destroyed
  - resource "aws_api_gateway_integration" "companies_count_by_size_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "8cccuf" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-8cccuf-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "8cccuf" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_count_by_size_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.companies_kpi_average_integration will be destroyed
  - resource "aws_api_gateway_integration" "companies_kpi_average_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "nzd6kx" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-nzd6kx-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "nzd6kx" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_companies_kpi_average_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.expected_growth_and_margin_integration will be destroyed
  - resource "aws_api_gateway_integration" "expected_growth_and_margin_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "2xxfg3" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-2xxfg3-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "2xxfg3" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_expected_growth_and_margin_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.growth_and_margin_integration will be destroyed
  - resource "aws_api_gateway_integration" "growth_and_margin_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "d1oz8z" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-d1oz8z-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "d1oz8z" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_growth_and_margin_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.revenue_and_ebitda_integration will be destroyed
  - resource "aws_api_gateway_integration" "revenue_and_ebitda_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "n74ec0" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-n74ec0-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "n74ec0" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_revenue_and_ebitda_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.universe_overview_integration will be created
  + resource "aws_api_gateway_integration" "universe_overview_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_companies_count_by_size_method will be destroyed
  - resource "aws_api_gateway_method" "get_companies_count_by_size_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-8cccuf-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.sector"   = false
          - "method.request.querystring.vertical" = false
        } -> null
      - resource_id          = "8cccuf" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_companies_kpi_average_method will be destroyed
  - resource "aws_api_gateway_method" "get_companies_kpi_average_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-nzd6kx-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.metric"        = true
          - "method.request.querystring.scenario_type" = true
          - "method.request.querystring.sector"        = false
          - "method.request.querystring.vertical"      = false
          - "method.request.querystring.year"          = false
        } -> null
      - resource_id          = "nzd6kx" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_expected_growth_and_margin_method will be destroyed
  - resource "aws_api_gateway_method" "get_expected_growth_and_margin_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-2xxfg3-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.sector"   = false
          - "method.request.querystring.vertical" = false
          - "method.request.querystring.year"     = false
        } -> null
      - resource_id          = "2xxfg3" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_growth_and_margin_method will be destroyed
  - resource "aws_api_gateway_method" "get_growth_and_margin_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-d1oz8z-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.sector"   = false
          - "method.request.querystring.vertical" = false
          - "method.request.querystring.year"     = false
        } -> null
      - resource_id          = "d1oz8z" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_revenue_and_ebitda_method will be destroyed
  - resource "aws_api_gateway_method" "get_revenue_and_ebitda_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-n74ec0-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.sector"   = false
          - "method.request.querystring.vertical" = false
          - "method.request.querystring.year"     = false
        } -> null
      - resource_id          = "n74ec0" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_universe_overview_method will be created
  + resource "aws_api_gateway_method" "get_universe_overview_method" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.sector"   = false
          + "method.request.querystring.vertical" = false
          + "method.request.querystring.year"     = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.companies_count_by_size will be destroyed
  - resource "aws_api_gateway_resource" "companies_count_by_size" {
      - id          = "8cccuf" -> null
      - parent_id   = "bnvar7" -> null
      - path        = "/companies/count-by-size" -> null
      - path_part   = "count-by-size" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.companies_kpi_average will be destroyed
  - resource "aws_api_gateway_resource" "companies_kpi_average" {
      - id          = "nzd6kx" -> null
      - parent_id   = "bnvar7" -> null
      - path        = "/companies/kpi-average" -> null
      - path_part   = "kpi-average" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.expected_growth_and_margin will be destroyed
  - resource "aws_api_gateway_resource" "expected_growth_and_margin" {
      - id          = "2xxfg3" -> null
      - parent_id   = "bnvar7" -> null
      - path        = "/companies/expected_growth_and_margin" -> null
      - path_part   = "expected_growth_and_margin" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.growth_and_margin will be destroyed
  - resource "aws_api_gateway_resource" "growth_and_margin" {
      - id          = "d1oz8z" -> null
      - parent_id   = "bnvar7" -> null
      - path        = "/companies/growth_and_margin" -> null
      - path_part   = "growth_and_margin" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.revenue_and_ebitda will be destroyed
  - resource "aws_api_gateway_resource" "revenue_and_ebitda" {
      - id          = "n74ec0" -> null
      - parent_id   = "bnvar7" -> null
      - path        = "/companies/revenue_and_ebitda" -> null
      - path_part   = "revenue_and_ebitda" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.universe_overview will be created
  + resource "aws_api_gateway_resource" "universe_overview" {
      + id          = (known after apply)
      + parent_id   = "bnvar7"
      + path        = (known after apply)
      + path_part   = "universe_overview"
      + rest_api_id = "kb7gblbu69"
    }

  # module.policy.aws_iam_role.companies_count_by_size_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "companies_count_by_size_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_companies_count_by_size_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-03T14:59:53Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_companies_count_by_size_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_companies_count_by_size_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHQTPKU6DZU" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role.companies_kpi_average_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "companies_kpi_average_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_companies_kpi_average_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-03T14:59:54Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_companies_kpi_average_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_companies_kpi_average_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHXFO4STSRL" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role.get_expected_growth_and_margin_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "get_expected_growth_and_margin_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_get_expected_growth_and_margin_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-06T13:21:11Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_get_expected_growth_and_margin_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_get_expected_growth_and_margin_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHQRS3AQ6VN" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role.get_growth_and_margin_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "get_growth_and_margin_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_get_growth_and_margin_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-03T17:34:18Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_get_growth_and_margin_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_get_growth_and_margin_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHWKC34EWXM" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role.get_revenue_and_ebitda_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "get_revenue_and_ebitda_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_get_revenue_and_ebitda_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-06T19:54:12Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_get_revenue_and_ebitda_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_get_revenue_and_ebitda_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHTZ2ZVRJVD" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role.get_universe_overview_lambda_exec_role will be created
  + resource "aws_iam_role" "get_universe_overview_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_universe_overview_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy_attachment.companies_count_by_size_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "companies_count_by_size_lambda_logs" {
      - id         = "demo_companies_count_by_size_lambda_exec_role-20211203145958636500000001" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_companies_count_by_size_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.companies_count_by_size_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "companies_count_by_size_lambda_vpc" {
      - id         = "demo_companies_count_by_size_lambda_exec_role-20211203145958636500000002" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_companies_count_by_size_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.companies_kpi_average_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "companies_kpi_average_lambda_logs" {
      - id         = "demo_companies_kpi_average_lambda_exec_role-20211203145959763300000004" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_companies_kpi_average_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.companies_kpi_average_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "companies_kpi_average_lambda_vpc" {
      - id         = "demo_companies_kpi_average_lambda_exec_role-20211203145959698700000003" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_companies_kpi_average_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_expected_growth_and_margin_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_expected_growth_and_margin_lambda_logs" {
      - id         = "demo_get_expected_growth_and_margin_lambda_exec_role-20211206132112922400000001" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_get_expected_growth_and_margin_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_expected_growth_and_margin_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_expected_growth_and_margin_lambda_vpc" {
      - id         = "demo_get_expected_growth_and_margin_lambda_exec_role-20211206132112928300000002" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_get_expected_growth_and_margin_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_growth_and_margin_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_growth_and_margin_lambda_logs" {
      - id         = "demo_get_growth_and_margin_lambda_exec_role-20211203173419911900000002" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_get_growth_and_margin_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_growth_and_margin_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_growth_and_margin_lambda_vpc" {
      - id         = "demo_get_growth_and_margin_lambda_exec_role-20211203173419901400000001" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_get_growth_and_margin_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_revenue_and_ebitda_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_revenue_and_ebitda_lambda_logs" {
      - id         = "demo_get_revenue_and_ebitda_lambda_exec_role-20211206195416259100000001" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_get_revenue_and_ebitda_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_revenue_and_ebitda_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_revenue_and_ebitda_lambda_vpc" {
      - id         = "demo_get_revenue_and_ebitda_lambda_exec_role-20211206195416725500000002" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_get_revenue_and_ebitda_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_universe_overview_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_universe_overview_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_universe_overview_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_universe_overview_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_companies_count_by_size_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_companies_count_by_size_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_companies_count_by_size_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_companies_kpi_average_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_companies_kpi_average_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_companies_kpi_average_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_expected_growth_and_margin_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_expected_growth_and_margin_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_expected_growth_and_margin_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGatewayExpectedGrowthAndMargin" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGatewayExpectedGrowthAndMargin" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_growth_and_margin_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_growth_and_margin_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_growth_and_margin_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGatewayGrowthAndMargin" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGatewayGrowthAndMargin" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_revenue_and_ebitda_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_revenue_and_ebitda_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_revenue_and_ebitda_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGatewayRevenueAndEbitda" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGatewayRevenueAndEbitda" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_universe_overview_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_universe_overview_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayRuleOf40"
    }

Plan: 11 to add, 34 to change, 51 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*